# FailureMessage Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureMessage Constructor
FailureMessage Class See Also
---
Creates a new FailureMessage related to a given FailureDefinition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FailureMessage(
	FailureDefinitionId id
)
```

Visual Basic
---
```text
Public Sub New ( _
	id As FailureDefinitionId _
)
```

Visual C++
---
```text
public:
FailureMessage(
	FailureDefinitionId^ id
)
```

# ### Parameters
id
    Type: Autodesk.Revit.DB..::..FailureDefinitionId Id of FailureDefinition.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | id is valid or does not have corresponding failure definition. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FailureMessage Class
Autodesk.Revit.DB Namespace